Revit 2024 API
ContinuousRailType.StartOrBottomExtensionLength Property
 The extension length of the rail termination at the beginning or bottom.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double StartOrBottomExtensionLength { get; set; }
Visual Basic
Public Property StartOrBottomExtensionLength As Double
	Get
	Set
Visual C++
public:
property double StartOrBottomExtensionLength {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for startExtensionLength must be between 0 and 30000 feet.
See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace